{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 I'm Brannon Starnes. Thanks for taking the time to checkout my development portfolio!",
      "section_name": {
        "about": "I’m a software developer, mountaineer, experiential educator, and Navy Diver. I graduated from the University of Utah in 2009 where I received a Bachelor of Science in Experiential Education. Specifically I used rock climbing, ice climbing, mountaineering, and other challenging outdoor pursuits to teach teams about risk management, effective communication, logistics planning, and ultimately, team dynamics. About the time my student loans came due for payment, I realized my passion for teaching in the mountains would not pay the bills, and I decided it was time to fulfill my duty to the country. I enlisted in the Navy in 2011, and pursued the rigorous path toward Special Operations. I found myself thriving in such an environment, and was awarded both in recognition and authority. By my second tour, I was placed in charge of 14 divers and oversaw the daily accomplishment of underwater repair activities on forward deployed ships. At my third command, I was hand picked for a Lead Diving Representative role for two SEAL Task Units, where I managed an inventory of sophisticated diving equipment and underwater vehicles valued at $2.4M. My interest in software development was piqued in 2020 when I attended a school to learn to program Unmanned Underwater Vehicles. During that class I realized that I wanted to have the ability to think of a technology that could improve lives or processes, and make it a reality. So, I made plans to separate from active duty and pursue software development full-time. I’m looking forward to offering my talents to a company that uses technology to solve pressing environmental or humanitarian needs.",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Meditation Station",
        "startDate": "2021",
        "description": "Meditation Station is a customizable meditation/relaxation page. Features include personalized background selection, sound selection, and session timer. The sky in each destination background will change depending on the user's time of day (i.e. your destination will display a rising sun in the morning or a starry sky at night).",
        "images": [
          "images/portfolio/meditation-station/p1.jpg",
          "images/portfolio/meditation-station/p2.jpg",
          "images/portfolio/meditation-station/p3.jpg",
          "images/portfolio/meditation-station/p4.jpg",
          "images/portfolio/meditation-station/p5.jpg",
          "images/portfolio/meditation-station/p6.jpg"
        ],
        "url": "https://chillventure.github.io/Meditation-Station/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "Javascript"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML5"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS3"
          }
        ]
      },
      {
        "title": "Horned Beasts",
        "startDate": "2021",
        "description": "My first application using React! Peruse a fine gallery of Legendary Horned Beasts and vote for your favorites. Filter the beasts by their number of horns or click an image to get a better view. Makes use of React Bootstrap and JSON mapping.",
        "images": [
          "images/portfolio/horned-beasts/hornedBeastCap.jpg",
          "images/portfolio/horned-beasts/hornedBeastCap2.jpg"
        ],
        "url": "https://horned-beasts-of-legend.netlify.app/",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS3"
          }
        ]
      },
      {
        "title": "Work in Progress: Air Diving Assitant",
        "startDate": "2021",
        "description": "My very first app and still a passion project. This is where it all started, accomplished with self teaching, poor practices, and pure determination. I couldn't be more proud for having zero programming background or education at the time this was project began. I wanted to build my very own application for tracking and logging dive times and events AND have a simple SCUBA duration calculator at my fingertips. This would be the perfect tool for any diving supervisor. ",
        "images": [
          "images/portfolio/dive-app/diveApp_portfolio_screenshot.jpg",
          "images/portfolio/dive-app/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "US Navy",
        "title": "First Class Navy Diver",
        "years": "09.2011 - 09.2021",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }
